app/views/visitors/index.html.erb

SELECT COUNT(*) FROM "users"
---
<h3><%=t('Welcome')%></h3>
<p><%= link_to t('Users:'), users_path %> <%= User.count %> registered</p>