app/views/home/index.html.erb

        <p><%= link_to 'Cadastrar', new_user_registration_path, :class => "button rigth" %> ou <%= link_to 'Logar', new_user_session_path, :class => "button rigth" %></p>
        <p><%= User.count %>  <%=t("Registered users")%></p>
---
SELECT COUNT(*) FROM "users"