app/controllers/searches_controller.rb

INSERT INTO "searches" ("COD_ALUNO", "COD_TURMA", "COD_TURNO", "DESC_TURMA", "DESC_TURNO", "NOME_PESSOA", "N_PASTA", "PERIODO_ATUAL", "desc_turno") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @gerar_pedido1 = Aluno.turno_atual_salvar(@@matricula).fetch(0).attributes
    @gerar_pedido2 = Turma.turma_disponivel_salvar(@@search_in_academico_periodo_atual.periodo_atual, @@search_in_academico_codigo_do_curso.cod_curso, @@search_in_academico_codigo_do_turno.cod_turno).fetch(0).attributes
    @hash_de_pedido = @gerar_pedido1, @gerar_pedido2
    @hash_unico_salvar = @hash_de_pedido.inject(:merge)
    @salvar = Search.new(@hash_unico_salvar)
    @salvar.save